// any → সবকিছুই allowed (unsafe type)

let value : any
value = 'Hasan'
value = 1432
value = true
value = {name:'Anam'}


// unknown হলো any-এর মতোই flexible,
// কিন্তু টাইপ না চেক করে ব্যবহার করা যায় না।

// অর্থাৎ, “তুমি যেকোনো কিছু রাখতে পারো,
// কিন্তু ব্যবহারের আগে তার টাইপ যাচাই করতে হবে।”

let data : unknown;


data = 'shakil'
data = false
data = 200

// console.log(data.toUpperCase())
// console.log(data.toFixed(200)); // ❌ Error

if(typeof data === 'number'){
    console.log(data.toFixed(200))
}

// 🔹 মূল পার্থক্য:
// unknown টাইপকে আগে চেক করতে হয়,
// যেখানে any সরাসরি ব্যবহার করা যায় (কিন্তু unsafe)।



// যখন কোনো ফাংশন কখনো কিছু return করে না
// (যেমন — error ছোড়ে, অথবা infinite loop চলে),
// তখন তার return type হয় never।

function throwError(message:string):never{
   throw new Error(message)  // ✅ এখানে কিছুই return হবে না
}

function infiniteLoop():never{
  while(true){
    console.log('Running forever ...')
  }
}



// any     =	“আমি জানি না, যেকোনো কিছুই হবে — টাইপ চেক কোরো না।”
// unknown =	“যেকোনো কিছু হতে পারে, তবে আগে টাইপ চেক করো।”
// never   =	“এখানে কোনো কিছুই ঘটবে না বা ফিরবে না।”